Revit 2027 API
BuiltInFailures.RegenFailures.RegenElements Property
 Regenerating elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RegenElements { get; }
Public Shared ReadOnly Property RegenElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RegenElements {
	FailureDefinitionId^ get ();
}
static member RegenElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace